Revit 2026 API

# CorrectionFactorSetContains Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Contains(
	CorrectionFactor item
)
```
```vb
Public Overridable Function Contains (
	item As CorrectionFactor
) As Boolean
```
```cpp
public:
virtual bool Contains(
	CorrectionFactor^ item
)
```
```fsharp
abstract Contains :
        item : CorrectionFactor -> bool
override Contains :
        item : CorrectionFactor -> bool
```

#### Parameters

item CorrectionFactor

#### Return Value

Boolean

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace